In [1]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

NameError: name 'pd' is not defined

In [7]:
import pandas as pd

In [8]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [9]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [10]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [11]:
string_data[0] = None

In [12]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [13]:
from numpy import nan as NA

In [14]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [15]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [16]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [18]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                   [NA, NA, NA], [NA, 6.5, 3.]])

In [19]:
cleaned = data.dropna()

In [20]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [21]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [22]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [23]:
data[4] = NA

In [24]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [25]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [26]:
df = pd.DataFrame(np.random.randn(7, 3))

In [27]:
df.iloc[:4, 1] = NA

In [28]:
df.iloc[:2, 2] = NA

In [29]:
df

          0         1         2
0  1.154401       NaN       NaN
1  0.844002       NaN       NaN
2  0.159148       NaN -3.224009
3 -0.416122       NaN -0.926267
4 -1.298322  2.485794  0.964414
5 -0.468116 -0.603973 -0.577976
6  1.418154 -1.173709  0.127290

In [30]:
df.dropna()

          0         1         2
4 -1.298322  2.485794  0.964414
5 -0.468116 -0.603973 -0.577976
6  1.418154 -1.173709  0.127290

In [31]:
df.dropna(thresh=2)

          0         1         2
2  0.159148       NaN -3.224009
3 -0.416122       NaN -0.926267
4 -1.298322  2.485794  0.964414
5 -0.468116 -0.603973 -0.577976
6  1.418154 -1.173709  0.127290

In [32]:
df.fillna(0)

          0         1         2
0  1.154401  0.000000  0.000000
1  0.844002  0.000000  0.000000
2  0.159148  0.000000 -3.224009
3 -0.416122  0.000000 -0.926267
4 -1.298322  2.485794  0.964414
5 -0.468116 -0.603973 -0.577976
6  1.418154 -1.173709  0.127290

In [33]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  1.154401  0.500000  0.000000
1  0.844002  0.500000  0.000000
2  0.159148  0.500000 -3.224009
3 -0.416122  0.500000 -0.926267
4 -1.298322  2.485794  0.964414
5 -0.468116 -0.603973 -0.577976
6  1.418154 -1.173709  0.127290

In [34]:
_ = df.fillna(0, inplace=True)

In [35]:
df

          0         1         2
0  1.154401  0.000000  0.000000
1  0.844002  0.000000  0.000000
2  0.159148  0.000000 -3.224009
3 -0.416122  0.000000 -0.926267
4 -1.298322  2.485794  0.964414
5 -0.468116 -0.603973 -0.577976
6  1.418154 -1.173709  0.127290

In [36]:
df = pd.DataFrame(np.random.randn(6, 3))

In [37]:
df.iloc[2:, 1] = NA

In [38]:
df.iloc[4:, 2] = NA

In [39]:
df

          0         1         2
0 -0.040388  1.124765 -0.811369
1 -0.609357  1.697157 -1.242736
2  0.103072       NaN -0.834720
3  0.821278       NaN  2.429559
4 -0.755480       NaN       NaN
5 -0.682703       NaN       NaN

In [40]:
df.fillna(method='ffill')

          0         1         2
0 -0.040388  1.124765 -0.811369
1 -0.609357  1.697157 -1.242736
2  0.103072  1.697157 -0.834720
3  0.821278  1.697157  2.429559
4 -0.755480  1.697157  2.429559
5 -0.682703  1.697157  2.429559

In [41]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.040388  1.124765 -0.811369
1 -0.609357  1.697157 -1.242736
2  0.103072  1.697157 -0.834720
3  0.821278  1.697157  2.429559
4 -0.755480       NaN  2.429559
5 -0.682703       NaN  2.429559

In [42]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [43]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [44]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                    'k2': [1, 1, 2, 3, 3, 4, 4]})

In [45]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [46]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [47]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [48]:
data['v1'] = range(7)

In [49]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [50]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [52]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon'
                             'Pastrami', 'corned beef', 'Bacon',
                             'pastrami', 'honey ham', 'nova lox'],
                    'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

ValueError: arrays must all be same length

In [53]:
data = pd.Series([1, -999, 2, -999, -1000, 3])

In [54]:
data

0       1
1    -999
2       2
3    -999
4   -1000
5       3
dtype: int64

In [55]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [56]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [57]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [58]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [59]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                   index=['Ohio', 'Colorado', 'NewYork'],
                   columns=['one', 'two', 'three', 'four'])

In [60]:
transform = lambda x: x[:4].upper()

In [61]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEWY'], dtype='object')

In [62]:
data.index = data.index.map(transform)

In [63]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEWY    8    9     10    11

In [64]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
Newy    8    9     10    11

In [65]:
data.rename(index={'OHIO': 'INDIANA'},
           columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEWY       8    9        10    11

In [66]:
data.rename(index={'OHIO:' 'INDIANA'}, inplace=True)

TypeError: 'set' object is not callable

In [67]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEWY    8    9     10    11

In [68]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [69]:
bins = [18, 25, 35, 60, 100]

In [70]:
cats = pd.cut(ages, bins)

In [71]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [72]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [73]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [74]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [75]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [76]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [77]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [78]:
data = np.random.rand(20)

In [79]:
pd.cut(data, 4, precision=2)

[(0.46, 0.69], (0.69, 0.91], (0.46, 0.69], (0.69, 0.91], (0.23, 0.46], ..., (0.0046, 0.23], (0.69, 0.91], (0.0046, 0.23], (0.69, 0.91], (0.23, 0.46]]
Length: 20
Categories (4, interval[float64]): [(0.0046, 0.23] < (0.23, 0.46] < (0.46, 0.69] < (0.69, 0.91]]

In [80]:
data = np.random.randn(1000)

In [81]:
cats = pd.qcut(data, 4)

In [82]:
cats

[(-0.00218, 0.68], (-3.166, -0.67], (-0.67, -0.00218], (0.68, 3.102], (0.68, 3.102], ..., (0.68, 3.102], (0.68, 3.102], (-0.00218, 0.68], (-3.166, -0.67], (-0.67, -0.00218]]
Length: 1000
Categories (4, interval[float64]): [(-3.166, -0.67] < (-0.67, -0.00218] < (-0.00218, 0.68] < (0.68, 3.102]]

In [83]:
pd.value_counts(cats)

(0.68, 3.102]        250
(-0.00218, 0.68]     250
(-0.67, -0.00218]    250
(-3.166, -0.67]      250
dtype: int64

In [84]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-0.00218, 1.277], (-1.305, -0.00218], (-1.305, -0.00218], (1.277, 3.102], (1.277, 3.102], ..., (-0.00218, 1.277], (1.277, 3.102], (-0.00218, 1.277], (-1.305, -0.00218], (-1.305, -0.00218]]
Length: 1000
Categories (4, interval[float64]): [(-3.166, -1.305] < (-1.305, -0.00218] < (-0.00218, 1.277] < (1.277, 3.102]]

In [85]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [86]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.001918    -0.071415     0.033549    -0.017735
std       0.983708     0.962881     1.004558     1.005423
min      -3.518474    -3.602067    -3.093462    -3.137753
25%      -0.643901    -0.723893    -0.631778    -0.682202
50%      -0.011486    -0.079881     0.020557     0.008414
75%       0.691183     0.556230     0.762580     0.622917
max       3.364660     2.738518     3.292603     3.363406

In [87]:
col = data[2]

In [88]:
col[np.abs(col) > 3]

450    3.292603
729   -3.093462
Name: 2, dtype: float64

In [89]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
14   0.005642  1.268081 -0.381080 -3.094730
72  -3.171751  0.479616  0.640307  0.080404
219  3.364660 -1.177238 -1.039580 -1.059164
307 -3.518474 -0.219088 -1.771478 -1.086430
450 -2.771519 -0.879610  3.292603  0.585727
585 -0.789768 -3.602067  0.486428  1.825290
653  0.064168 -0.303530 -0.479854  3.363406
729 -0.344716 -1.999575 -3.093462  0.403986
775  1.198234 -0.940341  1.412021 -3.137753
861 -3.298890 -0.112733 -0.585124  1.154103

In [90]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [91]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.001294    -0.070812     0.033350    -0.017866
std       0.979301     0.960857     1.003363     1.003559
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.643901    -0.723893    -0.631778    -0.682202
50%      -0.011486    -0.079881     0.020557     0.008414
75%       0.691183     0.556230     0.762580     0.622917
max       3.000000     2.738518     3.000000     3.000000

In [92]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0  1.0 -1.0
1  1.0 -1.0 -1.0 -1.0
2  1.0  1.0  1.0 -1.0
3 -1.0  1.0  1.0 -1.0
4 -1.0 -1.0 -1.0  1.0

In [93]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [94]:
sampler = np.random.permutation(5)

In [95]:
sampler

array([1, 4, 0, 2, 3])

In [96]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [97]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
4  16  17  18  19
0   0   1   2   3
2   8   9  10  11
3  12  13  14  15

In [98]:
df.sample(n=3)

    0   1   2   3
3  12  13  14  15
0   0   1   2   3
2   8   9  10  11

In [99]:
choices = pd.Series([5, 7, -1, 6, 4])

In [100]:
draws = choices.sample(n=10, replace=True)

In [101]:
draws

0    5
0    5
3    6
4    4
4    4
3    6
0    5
0    5
4    4
0    5
dtype: int64

In [102]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                  'data1': range(6)})

In [103]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [104]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [105]:
df_with_dummy = df[['data1']].join(dummies)

In [106]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [107]:
mnames = ['movie_id', 'title', 'genres']

In [109]:
movies = pd.read_table('datasets/movielens/movies.dat',sep='::',
                      header=None, names=mnames)

/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.

In [110]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [111]:
all_genres = []

In [112]:
for x in movies.genres:
    all_genres.extend(x.split('|'))

In [113]:
genres = pd.unique(all_genres)

In [114]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [116]:
zero_matrix = np.zeros((len(movies), len(genres)))

In [117]:
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [118]:
gen = movies.genres[0]

In [119]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [120]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2])

In [121]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [122]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [123]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [124]:
np.random.seed(12345)

In [125]:
values = np.random.rand(10)

In [126]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [127]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [128]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [129]:
val = 'a,b, guido'

In [130]:
val.split(',')

['a', 'b', ' guido']

In [131]:
pieces = [x.strip() for x in val.split(',')]

In [132]:
pieces

['a', 'b', 'guido']

In [133]:
first, second, third = pieces

In [134]:
first + '::' + second + '::' + third

'a::b::guido'

In [135]:
'::'.join(pieces)

'a::b::guido'

In [136]:
'guido' in val

True

In [137]:
val.index(',')

1

In [138]:
val.find(':')

-1

In [139]:
val.index(':')

ValueError: substring not found

In [140]:
val.count(',')

2

In [141]:
val.replace(',', '::')

'a::b:: guido'

In [142]:
val.replace(',', '')

'ab guido'

In [143]:
import re

In [144]:
text = "foo bar\t baz \tqux"

In [145]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [146]:
regex = re.compile('\s+')

In [147]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [148]:
regex.findall(text)

[' ', '\t ', ' \t']

In [149]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [150]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [151]:
m = regex.search(text)

In [152]:
m

In [153]:
text[m.start():m.end()]

'dave@google.com'

In [154]:
print(regex.match(text))

None

In [155]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [156]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [157]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [158]:
m = regex.match('wesm@bright.net')

In [159]:
m.groups()

('wesm', 'bright', 'net')

In [160]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [161]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3',text))
Dave Username: dave, Domain: google, Suffix: com

SyntaxError: invalid syntax (<ipython-input-161-d5e7d1387d57>, line 2)

In [162]:
data = {'Dave': 'dave@google.com', 
       'Steve': 'steve@gmail.com',
       'Rob': 'rob@gmail.com',
       'Wes': np.nan}

In [163]:
data =pd.Series(data)

In [164]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [165]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [166]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [167]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [168]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [169]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [170]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [171]:
matches.str.get(1)

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [173]:
matches.str[0]

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [174]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object